In [1]:
import configparser
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [7]:
config = configparser.ConfigParser()
config.read('calter.config')

['calter.config']

In [8]:
db = config['POSTGRES']['PG_DB']
retail_db = config['POSTGRES']['PG_ret']
hr_db = config['POSTGRES']['PG_hr']
user = config['POSTGRES']['PG_UNAME']
passwd = config['POSTGRES']['PG_PASS']
port = config['POSTGRES']['PG_PORT']
host = config['POSTGRES']['PG_HOST']

In [10]:
hr_db

'hr_db'

In [11]:
    credentials = "postgresql://{}:{}@{}:{}/{}".format(user,passwd,host,port,db)

In [12]:
credentials_ret = "postgresql://{}:{}@{}:{}/{}".format(user,passwd,host,port,retail_db)
credentials_hr = "postgresql://{}:{}@{}:{}/{}".format(user,passwd,host,port,hr_db)

In [13]:
#using psycopg2 to test connection since there are no tables
import psycopg2
try:
    conn = psycopg2.connect(host=host,dbname=db,user=user,password=passwd,port=port)
except Exception as e:
    print(e)
    
conn.set_session(autocommit=True)

try:
    cur = conn.cursor()
    
except:
    print(e)

In [15]:
#using psycopg2 to test connection since there are no tables
import psycopg2
try:
    conn_hr = psycopg2.connect(host=host,dbname=hr_db,user=user,password=passwd,port=port)
except Exception as e:
    print(e)
    
conn_hr.set_session(autocommit=True)

try:
    cur = conn_hr.cursor()
    
except:
    print(e)

In [17]:
credentials_hr

'postgresql://postgres:1234@localhost:5432/hr_db'

In [20]:
#Helper functions to work with the database
def schemaGen(dataframe, schemaName):
    localSchema = pd.io.sql.get_schema(dataframe,schemaName)
    localSchema = localSchema.replace('TEXT','VARCHAR(255)').replace('INTEGER','NUMERIC').replace('\n','').replace('"',"")
    return "".join(localSchema)

#Using pandas read_sql for getting schema
def getSchema(tableName, credentials):
    schema = pd.read_sql("""SELECT * FROM information_schema.columns where table_name='{}'""".format(tableName),con=credentials)
    return schema

#Issue is in using pd.read_sql to write data to the database. so using psycopg2
def queryTable(query):
    try:
        schema = cur.execute(query)
        return 
    except Exception as e:
        print(e)
        
#This doesn't return anything

#Using the pd.read_sql for getting data from db
def queryBase(query):
    requiredTable = pd.read_sql(query,con=credentials)
    return requiredTable

def queryBasehr(query):
    requiredTable = pd.read_sql(query,con=credentials_hr)
    return requiredTable

#This returns the dataframe

In [23]:
queryBasehr("""SELECT * FROM employees LIMIT 5""")

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000.0,None,NaN,90
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000.0,None,100.0,90
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000.0,None,100.0,90
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000.0,None,102.0,60
4,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000.0,None,103.0,60

In [24]:
queryBasehr("""SELECT * FROM departments LIMIT 5""")

   department_id       department_name manager_id  location_id
0            120              Treasury       None         1700
1            130         Corporate Tax       None         1700
2            140    Control And Credit       None         1700
3            150  Shareholder Services       None         1700
4            160              Benefits       None         1700

In [28]:
queryBasehr("""SELECT e.employee_id, e.department_id, e.salary,
                d.department_name
               FROM employees e 
               LEFT OUTER JOIN departments d
               ON e.department_id = d.department_id
               LIMIT 2""")

   employee_id  department_id   salary department_name
0          100             90  24000.0       Executive
1          101             90  17000.0       Executive

In [53]:
queryBasehr("""SELECT e.department_id,
                ae.avg_dept_salary,
                e.salary, e.employee_id, d.department_name
               FROM employees e 
               LEFT OUTER JOIN (
                   SELECT department_id, 
                   ROUND(AVG(salary)::numeric,2) AS avg_dept_salary
                   FROM employees
                   GROUP BY department_id
                   ) ae
               ON e.department_id = ae.department_id
               JOIN departments d
               ON ae.department_id = d.department_id
               WHERE e.salary > avg_dept_salary
               ORDER BY d.department_id,e.salary DESC""")

    department_id  avg_dept_salary   salary  employee_id department_name
0              20          9500.00  13000.0          201       Marketing
1              30          4150.00  11000.0          114      Purchasing
2              50          3475.56   8200.0          121        Shipping
3              50          3475.56   8000.0          120        Shipping
4              50          3475.56   7900.0          122        Shipping
5              50          3475.56   6500.0          123        Shipping
6              50          3475.56   5800.0          124        Shipping
7              50          3475.56   4200.0          184        Shipping
8              50          3475.56   4100.0          185        Shipping
9              50          3475.56   4000.0          192        Shipping
10             50          3475.56   3900.0          193        Shipping
11             50          3475.56   3800.0          188        Shipping
12             50          3475.56   3600.0          189        Shipping
13             50          3475.56   3600.0          137        Shipping
14             50          3475.56   3500.0          141        Shipping
15             60          5760.00   9000.0          103              IT
16             60          5760.00   6000.0          104              IT
17             80          8955.88  14000.0          145           Sales
18             80          8955.88  13500.0          146           Sales
19             80          8955.88  12000.0          147           Sales
20             80          8955.88  11500.0          168           Sales
21             80          8955.88  11000.0          174           Sales
22             80          8955.88  11000.0          148           Sales
23             80          8955.88  10500.0          149           Sales
24             80          8955.88  10500.0          162           Sales
25             80          8955.88  10000.0          156           Sales
26             80          8955.88  10000.0          169           Sales
27             80          8955.88  10000.0          150           Sales
28             80          8955.88   9600.0          170           Sales
29             80          8955.88   9500.0          163           Sales
30             80          8955.88   9500.0          151           Sales
31             80          8955.88   9500.0          157           Sales
32             80          8955.88   9000.0          152           Sales
33             80          8955.88   9000.0          158           Sales
34             90         19333.33  24000.0          100       Executive
35            100          8600.00  12000.0          108         Finance
36            100          8600.00   9000.0          109         Finance
37            110         10150.00  12000.0          205      Accounting

In [59]:
#Using windowing function

queryBasehr("""SELECT e.employee_id, e.department_id, e.salary,
    AVG(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS department_salary_expense
FROM employees e 
ORDER BY e.department_id, e.salary DESC""")

     employee_id  department_id   salary  department_salary_expense
0            200           10.0   4400.0                     4400.0
1            201           20.0  13000.0                     9500.0
2            202           20.0   6000.0                     9500.0
3            114           30.0  11000.0                     4150.0
4            115           30.0   3100.0                     4150.0
..           ...            ...      ...                        ...
102          111          100.0   7700.0                     8600.0
103          113          100.0   6900.0                     8600.0
104          205          110.0  12000.0                    10150.0
105          206          110.0   8300.0                    10150.0
106          178            NaN   7000.0                     7000.0

[107 rows x 4 columns]

In [63]:
queryBasehr("""SELECT t.employee_id, t.department_id, t.salary,
            d.department_name,
            ROUND(SUM(t.salary) OVER(
            PARTITION BY t.department_id
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW),2)
            AS cumulative_dept_salary
            FROM employees t
            LEFT OUTER JOIN departments d 
            ON t.department_id = d.department_id
            WHERE d.department_name IN ('Finance','IT')""")

,employee_id,department_id,salary,department_name,cumulative_dept_salary
0,103,60,9000.0,IT,9000.0
1,104,60,6000.0,IT,15000.0
2,105,60,4800.0,IT,19800.0
3,106,60,4800.0,IT,24600.0
4,107,60,4200.0,IT,28800.0
5,108,100,12000.0,Finance,12000.0
6,109,100,9000.0,Finance,21000.0
7,110,100,8200.0,Finance,29200.0
8,111,100,7700.0,Finance,36900.0
9,112,100,7800.0,Finance,44700.0
10,113,100,6900.0,Finance,51600.0

In [29]:
queryBase("""SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20""")

   order_date   revenue  moving_3day_revenue
0  2013-07-25  31547.23             31547.23
1  2013-07-26  54713.23             86260.46
2  2013-07-27  48411.48            134671.94
3  2013-07-28  35672.03            138796.74
4  2013-07-29  54579.70            138663.21
5  2013-07-30  49329.29            139581.02
6  2013-07-31  59212.49            163121.48
7  2013-08-01  49160.08            157701.86
8  2013-08-02  50688.58            159061.15
9  2013-08-03  43416.74            143265.40
10 2013-08-04  35093.01            129198.33
11 2013-08-05  34025.27            112535.02
12 2013-08-06  57843.89            126962.17
13 2013-08-07  45525.59            137394.75
14 2013-08-08  33549.47            136918.95
15 2013-08-09  29225.16            108300.22
16 2013-08-10  46435.04            109209.67
17 2013-08-11  31155.50            106815.70
18 2013-08-12  59014.74            136605.28
19 2013-08-13  17956.88            108127.12

In [32]:
queryBase("""SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20""")

   order_date   revenue  moving_3day_revenue
0  2013-07-25  31547.23            134671.94
1  2013-07-26  54713.23            170343.97
2  2013-07-27  48411.48            224923.67
3  2013-07-28  35672.03            242705.73
4  2013-07-29  54579.70            247204.99
5  2013-07-30  49329.29            247953.59
6  2013-07-31  59212.49            262970.14
7  2013-08-01  49160.08            251807.18
8  2013-08-02  50688.58            237570.90
9  2013-08-03  43416.74            212383.68
10 2013-08-04  35093.01            221067.49
11 2013-08-05  34025.27            215904.50
12 2013-08-06  57843.89            206037.23
13 2013-08-07  45525.59            200169.38
14 2013-08-08  33549.47            212579.15
15 2013-08-09  29225.16            185890.76
16 2013-08-10  46435.04            199379.91
17 2013-08-11  31155.50            183787.32
18 2013-08-12  59014.74            196605.61
19 2013-08-13  17956.88            199737.25

In [33]:
queryBase("""SELECT t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) AS rnk
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 30""")

   order_date  order_item_product_id   revenue  rnk
0  2013-07-25                   1004   5599.72    1
1  2013-07-25                    191   5099.49    2
2  2013-07-25                    957   4499.70    3
3  2013-07-25                    365   3359.44    4
4  2013-07-25                   1073   2999.85    5
5  2013-07-25                   1014   2798.88    6
6  2013-07-25                    403   1949.85    7
7  2013-07-25                    502   1650.00    8
8  2013-07-25                    627   1079.73    9
9  2013-07-25                    226    599.99   10
10 2013-07-25                     24    319.96   11
11 2013-07-25                    821    207.96   12
12 2013-07-25                    625    199.99   13
13 2013-07-25                    705    119.99   14
14 2013-07-25                    572    119.97   15
15 2013-07-25                    666    109.99   16
16 2013-07-25                    725    108.00   17
17 2013-07-25                    134    100.00   18
18 2013-07-25                    906     99.96   19
19 2013-07-25                    828     95.97   20
20 2013-07-25                    810     79.96   21
21 2013-07-25                    924     79.95   22
22 2013-07-25                    926     79.95   22
23 2013-07-25                     93     74.97   24
24 2013-07-25                    835     63.98   25
25 2013-07-25                    897     49.98   26
26 2013-07-26                   1004  10799.46    1
27 2013-07-26                    365   7978.67    2
28 2013-07-26                    957   6899.54    3
29 2013-07-26                    191   6799.32    4

In [34]:
queryBase("""SELECT
    t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) rnk,
    dense_rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) drnk,
    row_number() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) rn
FROM daily_product_revenue AS t
ORDER BY order_date, revenue DESC
LIMIT 30""")

   order_date  order_item_product_id   revenue  rnk  drnk  rn
0  2013-07-25                   1004   5599.72    1     1   1
1  2013-07-25                    191   5099.49    2     2   2
2  2013-07-25                    957   4499.70    3     3   3
3  2013-07-25                    365   3359.44    4     4   4
4  2013-07-25                   1073   2999.85    5     5   5
5  2013-07-25                   1014   2798.88    6     6   6
6  2013-07-25                    403   1949.85    7     7   7
7  2013-07-25                    502   1650.00    8     8   8
8  2013-07-25                    627   1079.73    9     9   9
9  2013-07-25                    226    599.99   10    10  10
10 2013-07-25                     24    319.96   11    11  11
11 2013-07-25                    821    207.96   12    12  12
12 2013-07-25                    625    199.99   13    13  13
13 2013-07-25                    705    119.99   14    14  14
14 2013-07-25                    572    119.97   15    15  15
15 2013-07-25                    666    109.99   16    16  16
16 2013-07-25                    725    108.00   17    17  17
17 2013-07-25                    134    100.00   18    18  18
18 2013-07-25                    906     99.96   19    19  19
19 2013-07-25                    828     95.97   20    20  20
20 2013-07-25                    810     79.96   21    21  21
21 2013-07-25                    924     79.95   22    22  22
22 2013-07-25                    926     79.95   22    22  23
23 2013-07-25                     93     74.97   24    23  24
24 2013-07-25                    835     63.98   25    24  25
25 2013-07-25                    897     49.98   26    25  26
26 2013-07-26                   1004  10799.46    1     1   1
27 2013-07-26                    365   7978.67    2     2   2
28 2013-07-26                    957   6899.54    3     3   3
29 2013-07-26                    191   6799.32    4     4   4

In [35]:
queryBase("""SELECT * FROM (
    SELECT nq.*,
        dense_rank() OVER (
            PARTITION BY order_date
            ORDER BY revenue DESC
        ) AS drnk
    FROM (
        SELECT o.order_date,
            oi.order_item_product_id,
            round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_status IN ('COMPLETE', 'CLOSED')
        GROUP BY o.order_date, oi.order_item_product_id
    ) nq
) nq1
WHERE drnk <= 5
ORDER BY order_date, revenue DESC
cv
LIMIT 20""")

   order_date  order_item_product_id   revenue  drnk
0  2013-07-25                   1004   5599.72     1
1  2013-07-25                    191   5099.49     2
2  2013-07-25                    957   4499.70     3
3  2013-07-25                    365   3359.44     4
4  2013-07-25                   1073   2999.85     5
5  2013-07-26                   1004  10799.46     1
6  2013-07-26                    365   7978.67     2
7  2013-07-26                    957   6899.54     3
8  2013-07-26                    191   6799.32     4
9  2013-07-26                   1014   4798.08     5
10 2013-07-27                   1004   9599.52     1
11 2013-07-27                    191   5999.40     2
12 2013-07-27                    957   5699.62     3
13 2013-07-27                   1073   5399.73     4
14 2013-07-27                    365   5099.15     5
15 2013-07-28                   1004   5599.72     1
16 2013-07-28                    957   5099.66     2
17 2013-07-28                    365   4799.20     3
18 2013-07-28                    403   4419.66     4
19 2013-07-28                    191   4299.57     5

In [36]:
queryBase("""
SELECT * FROM (SELECT dpr.*,
  dense_rank() OVER (
    PARTITION BY order_date
    ORDER BY revenue DESC
  ) AS drnk
FROM daily_product_revenue AS dpr) q
WHERE drnk <= 5
ORDER BY order_date, revenue DESC
LIMIT 20""")

   order_date  order_item_product_id   revenue  drnk
0  2013-07-25                   1004   5599.72     1
1  2013-07-25                    191   5099.49     2
2  2013-07-25                    957   4499.70     3
3  2013-07-25                    365   3359.44     4
4  2013-07-25                   1073   2999.85     5
5  2013-07-26                   1004  10799.46     1
6  2013-07-26                    365   7978.67     2
7  2013-07-26                    957   6899.54     3
8  2013-07-26                    191   6799.32     4
9  2013-07-26                   1014   4798.08     5
10 2013-07-27                   1004   9599.52     1
11 2013-07-27                    191   5999.40     2
12 2013-07-27                    957   5699.62     3
13 2013-07-27                   1073   5399.73     4
14 2013-07-27                    365   5099.15     5
15 2013-07-28                   1004   5599.72     1
16 2013-07-28                    957   5099.66     2
17 2013-07-28                    365   4799.20     3
18 2013-07-28                    403   4419.66     4
19 2013-07-28                    191   4299.57     5